{
  "spells": [
    {
      "name": "Animate Objects",
      "desc": "Objects come to life at your command. Choose up to ten nonmagical objects within range that are not being worn or carried. Medium targets count as two objects, Large targets count as four objects, Huge targets count as eight objects. You can't animate any object larger than Huge. Each target animates and becomes a creature under your control until the spell ends or until reduced to 0 hit points. \\par As a bonus action, you can mentally command any creature you made with this spell if the creature is within 500 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.\\par \\textbf{Animated Object Statistics} \\\\ \\footnotesize \\begin{tabular}{lcclcc} Size & HP & AC & Attack & Str & Dex \\\\ \\hline Tiny & 20 & 18 & +8 to hit, 1d4 + 4 damage & 4 & 18 \\\\ Small & 25 & 16 & +6 to hit, 1d8 + 2 damage & 6 & 14 \\\\ Medium & 40 & 13 & +5 to hit, 2d6 + 1 damage & 10 & 12 \\\\ Large & 50 & 10 & +6 to hit, 2d10 + 2 damage & 14 & 10 \\\\ Huge & 80 & 10 & +8 to hit, 2d12 + 4 damage & 18 & 6 \\end{tabular} \\par \\hfill (1/2)",
      "page": "PHB 213",
      "range": "120 feet",
      "components": "V, S",
      "ritual": "no",
      "duration": "Up to 1 minute",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "5th-level",
      "level_int": 5,
      "school": "Transmutation",
      "class": "Artificer, Bard, Sorcerer, Wizard"
    },
    {
      "name": "Animate Objects",
      "desc": "An animated object is a construct with AC, hit points, attacks, Strength, and Dexterity determined by its size. Its Constitution is 10 and its Intelligence and Wisdom are 3, and its Charisma is 1. Its speed is 30 feet; if the object lacks legs or other appendages it can use for locomotion, it instead has a flying speed of 30 feet and can hover. If the object is securely attached to a surface or a larger object, such as a chain bolted to a wall, its speed is 0. It has blindsight with a radius of 30 feet and is blind beyond that distance. When the animated object drops to 0 hit points, it reverts to its original object form, and any remaining damage carries over to its original object form. If you command an object to attack, it can make a single melee attack against a creature within 5 feet of it. It makes a slam attack with an attack bonus and bludgeoning damage determined by its size. The DM might rule that a specific object inflicts slashing or piercing damage based on its form.",
      "higher_level": "If you cast this spell using a spell slot of 6th level or higher, you can animate two additional objects for each slot level above 5th. \\par \\hfill (2/2)",
      "page": "PHB 213",
      "range": "120 feet",
      "components": "V, S",
      "ritual": "no",
      "duration": "Up to 1 minute",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "5th-level",
      "level_int": 5,
      "school": "Transmutation",
      "class": "Artificer, Bard, Sorcerer, Wizard"
    }.,
    {
      "name": "Antimagic Field",
      "desc": "A 10-foot-radius invisible sphere of antimagic surrounds you. This area is divorced from the magical energy that suffuses the multiverse. Within the sphere, spells can't be cast, summoned creatures disappear, and even magic items become mundane. Until the spell ends, the sphere moves with you, centered on you. \\par Spells and other magical effects, except those created by an artifact or a deity, are suppressed in the sphere and can't protrude into it. A slot expended to cast a suppressed spell is consumed. While an effect is suppressed, it doesn't function, but the time it spends suppressed counts against its duration. \\par\\textbf{Targeted Effects.} Spells and other magical effects, such as \\textit{magic missile} and charm person, that target a creature or an object in the sphere have no effect on that target. \\par\\textbf{Areas of Magic.} The area of another spell or magical effect, such as \\textit{fireball}, can't extend into the sphere. If the sphere overlaps an area of magic, the part of the area that is covered by the sphere is suppressed. For example, the flames created by a \\textit{wall of fire} are suppressed within the sphere, creating a gap in the wall if the overlap is large enough. \\par\\textbf{Spells.} Any active spell or other magical effect on a creature or an object in the sphere is suppressed while the creature or object is in it. \\par \\hfill (1/2)",
      "page": "PHB 213",
      "range": "Self",
      "components": "V, S, M",
      "material": "A pinch of powdered iron or iron filings.",
      "ritual": "no",
      "duration": "Up to 1 hour",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "8th-level",
      "level_int": 8,
      "school": "Abjuration",
      "class": "Cleric, Wizard"
    },
    {
      "name": "Antimagic Field",
      "desc": "\\textbf{Magic Items.} The properties and powers of magic items are suppressed in the sphere. For example, a +1 longsword in the sphere functions as a nonmagical longsword. A magic weapon's properties and powers are suppressed if it is used against a target in the sphere or wielded by an attacker in the sphere. If a magic weapon or a piece of magic ammunition fully leaves the sphere (for example, if you fire a magic arrow or throw a magic spear at a target outside the sphere), the magic of the item ceases to be suppressed as soon as it exits. \\par\\textbf{Magical Travel.} Teleportation and planar travel fail to work in the sphere, whether the sphere is the destination or the departure point for such magical travel. A portal to another location, world, or plane of existence, as well as an opening to an extradimensional space such as that created by the \\textit{rope trick} spell, temporarily closes while in the sphere. \\par\\textbf{Creatures and Objects.} A creature or object summoned or created by magic temporarily winks out of existence in the sphere. Such a creature instantly reappears once the space the creature occupied is no longer within the sphere. \\par\\textbf{Dispel Magic.} Spells and magical effects such as \\textit{dispel magic} have no effect on the sphere. Likewise, the spheres created by different \\textit{antimagic field} spells don't nullify each other. \\par \\hfill (2/2)",
      "page": "PHB 213",
      "range": "Self",
      "components": "V, S, M",
      "material": "A pinch of powdered iron or iron filings.",
      "ritual": "no",
      "duration": "Up to 1 hour",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "8th-level",
      "level_int": 8,
      "school": "Abjuration",
      "class": "Cleric, Wizard"
    },
    {
      "name": "Arcane Hand",
      "desc": "You create a Large hand of shimmering, translucent force in an unoccupied space that you can see within range. The hand lasts for the spell's duration, and it moves at your command, mimicking the movements of your own hand. The hand is an object that has AC 20 and hit points equal to your hit point maximum. If it drops to 0 hit points, the spell ends. It has a Strength of 26 (+8) and a Dexterity of 10 (+0). The hand doesn't fill its space. When you cast the spell and as a bonus action on your subsequent turns, you can move the hand up to 60 feet and then cause one of the following effects with it. \\par\\textbf{Clenched Fist.} The hand strikes one creature or object within 5 feet of it. Make a melee spell attack for the hand using your game statistics. On a hit, the target takes 4d8 force damage. \\par\\textbf{Forceful Hand.} The hand attempts to push a creature within 5 feet of it in a direction you choose. Make a check with the hand's Strength contested by the Strength (Athletics) check of the target. If the target is Medium or smaller, you have advantage on the check. If you succeed, the hand pushes the target up to 5 feet plus a number of feet equal to five times your spellcasting ability modifier. The hand moves with the target to remain within 5 feet of it. \\par \\hfill (1/2)",
      "page": "PHB 218",
      "range": "120 feet",
      "components": "V, S, M",
      "material": "An eggshell and a snakeskin glove.",
      "ritual": "no",
      "duration": "Up to 1 minute",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "5th-level",
      "level_int": 5,
      "school": "Evocation",
      "class": "Wizard"
    },
    {
      "name": "Arcane Hand",
      "desc": "\\textbf{Grasping Hand.} The hand attempts to grapple a Huge or smaller creature within 5 feet of it. You use the hand's Strength score to resolve the grapple. If the target is Medium or smaller, you have advantage on the check. While the hand is grappling the target, you can use a bonus action to have the hand crush it. When you do so, the target takes bludgeoning damage equal to 2d6 + your spellcasting ability modifier. \\par \\textbf{Interposing Hand.} The hand interposes itself between you and a creature you choose until you give the hand a different command. The hand moves to stay between you and the target, providing you with half cover against the target. The target can't move through the hand's space if its Strength score is less than or equal to the hand's Strength score. If its Strength score is higher than the hand's Strength score, the target can move toward you through the hand's space, but that space is difficult terrain for the target.",
      "higher_level": "When you cast this spell using a spell slot of 6th level or higher, the damage from the clenched fist option increases by 2d8 and the damage from the grasping hand increases by 2d6 for each slot level above 5th. \\par \\hfill (2/2)",
      "page": "PHB 218",
      "range": "120 feet",
      "components": "V, S, M",
      "material": "An eggshell and a snakeskin glove.",
      "ritual": "no",
      "duration": "Up to 1 minute",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "5th-level",
      "level_int": 5,
      "school": "Evocation",
      "class": "Wizard"
    },
    {
      "name": "Astral Projection",
      "desc": "You and up to eight willing creatures within range project your astral bodies into the Astral Plane (the spell fails and the casting is wasted if you are already on that plane). The material body you leave behind is unconscious and in a state of suspended animation; it doesn't need food or air and doesn't age. \\par Your astral body resembles your mortal form in almost every way, replicating your game statistics and possessions. The principle difference is the addition of a silvery cord that extends from between your shoulder blades and trails behind you, fading to invisibility after 1 foot. This cord is your tether to your material body. As long as the tether remains intact, you can find your way home. If the cord is cut-something that can happen only when an effect specifically states that it does-your soul and body are separated, killing you instantly. \\par Your astral form can freely travel through the Astral Plane and can pass through portals there leading to any other plane. If you enter a new plane or return to the plane you were on when casting this spell, your body and possessions are transported along the silver cord, allowing you to re-enter your body as you enter the new plane. Your astral form is a separate incarnation. Any damage or other effects that apply to it have no effect on your physical body, nor do they persist when you return to it. \\par \\hfill (1/2)",
      "page": "PHB 215",
      "range": "10 feet",
      "components": "V, S, M",
      "material": "For each creature you affect with this spell, you must provide one jacinth worth at least 1,000gp and one ornately carved bar of silver worth at least 100gp, all of which the spell consumes.",
      "ritual": "no",
      "duration": "Special",
      "concentration": "no",
      "casting_time": "1 hour",
      "level": "9th-level",
      "level_int": 9,
      "school": "Necromancy",
      "class": "Cleric, Warlock, Wizard"
    },
    {
      "name": "Astral Projection",
      "desc": "The spell ends for you and your companions when you use your action to dismiss it. When the spell ends, the affected creature returns to its physical body, and it awakens. \\par The spell might also end early for you or one of your companions. A successful \\textit{dispel magic} spell used against an astral or physical body ends the spell for that creature. If a creature's original body or its astral form drops to 0 hit points, the spell ends for that creature. If the spell ends and the silver cord is intact, the cord pulls the creature's astral form back to its body, ending its state of suspended animation. \\par If you are returned to your body prematurely, your companions remain in their astral forms and must find their own way back to their bodies, usually by dropping to 0 hit points. \\par \\hfill (2/2)",
      "page": "PHB 215",
      "range": "10 feet",
      "components": "V, S, M",
      "material": "For each creature you affect with this spell, you must provide one jacinth worth at least 1,000gp and one ornately carved bar of silver worth at least 100gp, all of which the spell consumes.",
      "ritual": "no",
      "duration": "Special",
      "concentration": "no",
      "casting_time": "1 hour",
      "level": "9th-level",
      "level_int": 9,
      "school": "Necromancy",
      "class": "Cleric, Warlock, Wizard"
    },
    {
      "name": "Contagion",
      "desc": "Your touch inflicts disease. Make a melee spell attack against a creature within your reach. On a hit, you afflict the creature with a disease of your choice from any of the ones described below. \\par At the end of each of the target's turns, it must make a constitution saving throw. After failing three of these saving throws, the disease's effects last for the duration, and the creature stops making these saves. After succeeding on three of these saving throws, the creature recovers from the disease, and the spell ends. \\par Since this spell induces a natural disease in its target, any effect that removes a disease or otherwise ameliorates a disease's effects apply to it. \\par\\textbf{Blinding Sickness.} Pain grips the creature's mind, and its eyes turn milky white. The creature has disadvantage on wisdom checks and wisdom saving throws and is blinded. \\par\\textbf{Filth Fever.} A raging fever sweeps through the creature's body. The creature has disadvantage on strength checks, strength saving throws, and attack rolls that use Strength. \\par \\hfill (1/2)",
      "page": "PHB 227",
      "range": "Touch",
      "components": "V, S",
      "ritual": "no",
      "duration": "7 days",
      "concentration": "no",
      "casting_time": "1 action",
      "level": "5th-level",
      "level_int": 5,
      "school": "Necromancy",
      "class": "Cleric, Druid"
    },
    {
      "name": "Contagion",
      "desc": "\\textbf{Flesh Rot.} The creature's flesh decays. The creature has disadvantage on Charisma checks and vulnerability to all damage. \\par\\textbf{Mindfire.} The creature's mind becomes feverish. The creature has disadvantage on intelligence checks and intelligence saving throws, and the creature behaves as if under the effects of the confusion spell during combat. \\par\\textbf{Seizure.} The creature is overcome with shaking. The creature has disadvantage on dexterity checks, dexterity saving throws, and attack rolls that use Dexterity. \\par\\textbf{Slimy Doom.} The creature begins to bleed uncontrollably. The creature has disadvantage on constitution checks and constitution saving throws. In addition, whenever the creature takes damage, it is stunned until the end of its next turn. \\par \\hfill (2/2)",
      "page": "PHB 227",
      "range": "Touch",
      "components": "V, S",
      "ritual": "no",
      "duration": "7 days",
      "concentration": "no",
      "casting_time": "1 action",
      "level": "5th-level",
      "level_int": 5,
      "school": "Necromancy",
      "class": "Cleric, Druid"
    },
    {
      "name": "Control Water",
      "desc": "Until the spell ends, you control any freestanding water inside an area you choose that is a cube up to 100 feet on a side. You can choose from any of the following effects when you cast this spell. As an action on your turn, you can repeat the same effect or choose a different one. \\par\\textbf{Flood.} You cause the water level of all standing water in the area to rise by as much as 20 feet. If the area includes a shore, the flooding water spills over onto dry land. instead create a 20-foot tall wave that travels from one side of the area to the other and then crashes down. Any Huge or smaller vehicles in the wave's path are carried with it to the other side. Any Huge or smaller vehicles struck by the wave have a 25 percent chance of capsizing. The water level remains elevated until the spell ends or you choose a different effect. If this effect produced a wave, the wave repeats on the start of your next turn while the flood effect lasts. \\par \\textbf{Part Water.} You cause water in the area to move apart and create a trench. The trench extends across the spell's area, and the separated water forms a wall to either side. The trench remains until the spell ends or you choose a different effect. The water then slowly fills in the trench over the course of the next round until the normal water level is restored. \\par \\hfill (1/2)",
      "page": "PHB 227",
      "range": "300 feet",
      "components": "V, S, M",
      "material": "A drop of water and a pinch of dust.",
      "ritual": "no",
      "duration": "Up to 10 minutes",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "4th-level",
      "level_int": 4,
      "school": "Transmutation",
      "class": "Cleric, Druid, Wizard"
    },
    {
      "name": "Control Water",
      "desc": "\\textbf{Redirect Flow.} You cause flowing water in the area to move in a direction you choose, even if the water has to flow over obstacles, up walls, or in other unlikely directions. The water in the area moves as you direct it, but once it moves beyond the spell's area, it resumes its flow based on the terrain conditions. The water continues to move in the direction you chose until the spell ends or you choose a different effect. \\par\\textbf{Whirlpool.} This effect requires a body of water at least 50 feet square and 25 feet deep. You cause a whirlpool to form in the center of the area. The whirlpool forms a vortex that is 5 feet wide at the base, up to 50 feet wide at the top, and 25 feet tall. Any creature or object in the water and within 25 feet of the vortex is pulled 10 feet toward it. A creature can swim away from the vortex by making a Strength (Athletics) check against your spell save DC. When a creature enters the vortex for the first time on a turn or starts its turn there, it must make a strength saving throw. On a failed save, the creature takes 2d8 bludgeoning damage and is caught in the vortex until the spell ends. On a successful save, the creature takes half damage, and isn't caught in the vortex. A creature caught in the vortex can use its action to try to swim away from the vortex as described above, but has disadvantage on the Strength (Athletics) check to do so. The first time each turn that an object enters the vortex, the object takes 2d8 bludgeoning damage; this damage occurs each round it remains in the vortex. \\par \\hfill (2/2)",
      "page": "PHB 227",
      "range": "300 feet",
      "components": "V, S, M",
      "material": "A drop of water and a pinch of dust.",
      "ritual": "no",
      "duration": "Up to 10 minutes",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "4th-level",
      "level_int": 4,
      "school": "Transmutation",
      "class": "Cleric, Druid, Wizard"
    },
    {
      "name": "Detect Thoughts",
      "desc": "For the duration, you can read the thoughts of certain creatures. When you cast the spell and as your action on each turn until the spell ends, you can focus your mind on any one creature that you can see within 30 feet of you. If the creature you choose has an Intelligence of 3 or lower or doesn't speak any language, the creature is unaffected. \\par You initially learn the surface thoughts of the creature-what is most on its mind in that moment. As an action, you can either shift your attention to another creature's thoughts or attempt to probe deeper into the same creature's mind. If you probe deeper, the target must make a Wisdom saving throw. If it fails, you gain insight into its reasoning (if any), its emotional state, and something that looms large in its mind (such as something it worries over, loves, or hates). If it succeeds, the spell ends. Either way, the target knows that you are probing into its mind, and unless you shift your attention to another creature's thoughts, the creature can use its action on its turn to make an Intelligence check contested by your Intelligence check; if it succeeds, the spell ends. \\par \\hfill (1/2)",
      "page": "PHB 231",
      "range": "Self",
      "components": "V, S, M",
      "material": "A copper coin.",
      "ritual": "no",
      "duration": "Up to 1 minute",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "2nd-level",
      "level_int": 2,
      "school": "Divination",
      "class": "Bard, Sorcerer, Warlock, Wizard",
      "archetype": "Warlock: Great Old One",
      "patrons": "Great Old One"
    },
    {
      "name": "Detect Thoughts",
      "desc": "Questions verbally directed at the target creature naturally shape the course of its thoughts, so this spell is particularly effective as part of an interrogation. \\par You can also use this spell to detect the presence of thinking creatures you can't see. When you cast the spell or as your action during the duration, you can search for thoughts within 30 feet of you. The spell can penetrate barriers, but 2 feet of rock, 2 inches of any metal other than lead, or a thin sheet of lead blocks you. You can't detect a creature with an Intelligence of 3 or lower or one that doesn't speak any language. \\par Once you detect the presence of a creature in this way, you can read its thoughts for the rest of the duration as described above, even if you can't see it, but it must still be within range. \\par \\hfill (2/2)",
      "page": "PHB 231",
      "range": "Self",
      "components": "V, S, M",
      "material": "A copper coin.",
      "ritual": "no",
      "duration": "Up to 1 minute",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "2nd-level",
      "level_int": 2,
      "school": "Divination",
      "class": "Bard, Sorcerer, Warlock, Wizard",
      "archetype": "Warlock: Great Old One",
      "patrons": "Great Old One"
    },
    {
      "name": "Earthquake",
      "desc": "You create a seismic disturbance at a point on the ground that you can see within range. For the duration, an intense tremor rips through the ground in a 100-foot-radius circle centered on that point and shakes creatures and structures in contact with the ground in that area. \\par The ground in the area becomes difficult terrain. Each creature on the ground that is concentrating must make a constitution saving throw. On a failed save, the creature's concentration is broken. \\par When you cast this spell and at the end of each turn you spend concentrating on it, each creature on the ground in the area must make a dexterity saving throw. On a failed save, the creature is knocked prone. \\par This spell can have additional effects depending on the terrain in the area, as determined by the DM. \\par \\hfill (1/2)",
      "page": "PHB 236",
      "range": "500 feet",
      "components": "V, S, M",
      "material": "A pinch of dirt, a piece of rock, and a lump of clay.",
      "ritual": "no",
      "duration": "Up to 1 minute",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "8th-level",
      "level_int": 8,
      "school": "Evocation",
      "class": "Cleric, Druid, Sorcerer"
    },
    {
      "name": "Earthquake",
      "desc": "\\textbf{Fissures.} Fissures open throughout the spell's area at the start of your next turn after you cast the spell. A total of 1d6 such fissures open in locations chosen by the DM. Each is 1d10 × 10 feet deep, 10 feet wide, and extends from one edge of the spell's area to the opposite side. A creature standing on a spot where a fissure opens must succeed on a dexterity saving throw or fall in. A creature that successfully saves moves with the fissure's edge as it opens. A fissure that opens beneath a structure causes it to automatically collapse (see below). \\par\\textbf{Structures.} The tremor deals 50 bludgeoning damage to any structure in contact with the ground in the area when you cast the spell and at the start of each of your turns until the spell ends. If a structure drops to 0 hit points, it collapses and potentially damages nearby creatures. A creature within half the distance of a structure's height must make a dexterity saving throw. On a failed save, the creature takes 5d6 bludgeoning damage, is knocked prone, and is buried in the rubble, requiring a DC 20 Strength (Athletics) check as an action to escape. The DM can adjust the DC higher or lower, depending on the nature of the rubble. On a successful save, the creature takes half as much damage and doesn't fall prone or become buried. \\par \\hfill (2/2)",
      "page": "PHB 236",
      "range": "500 feet",
      "components": "V, S, M",
      "material": "A pinch of dirt, a piece of rock, and a lump of clay.",
      "ritual": "no",
      "duration": "Up to 1 minute",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "8th-level",
      "level_int": 8,
      "school": "Evocation",
      "class": "Cleric, Druid, Sorcerer"
    },
    {
      "name": "Enlarge/Reduce",
      "desc": "You cause a creature or an object you can see within range to grow larger or smaller for the duration. Choose either a creature or an object that is neither worn nor carried. If the target is unwilling, it can make a Constitution saving throw. On a success, the spell has no effect. \\par If the target is a creature, everything it is wearing and carrying changes size with it. Any item dropped by an affected creature returns to normal size at once. \\par\\textbf{Enlarge.} The target's size doubles in all dimensions, and its weight is multiplied by eight. This growth increases its size by one category-from Medium to Large, for example. If there isn't enough room for the target to double its size, the creature or object attains the maximum possible size in the space available. Until the spell ends, the target also has advantage on Strength checks and Strength saving throws. The target's weapons also grow to match its new size. While these weapons are enlarged, the target's attacks with them deal 1d4 extra damage.\\par \\hfill (1/2)",
      "page": "PHB 237",
      "range": "30 feet",
      "components": "V, S, M",
      "material": "A pinch of iron powder.",
      "ritual": "no",
      "duration": "Up to 1 minute",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "2nd-level",
      "level_int": 2,
      "school": "Transmutation",
      "class": "Artificer, Sorcerer, Wizard"
    },
    {
      "name": "Enlarge/Reduce",
      "desc": "\\textbf{Reduce.} The target's size is halved in all dimensions, and its weight is reduced to one-eighth of normal. This reduction decreases its size by one category-from Medium to Small, for example. Until the spell ends, the target also has disadvantage on Strength checks and Strength saving throws. The target's weapons also shrink to match its new size. While these weapons are reduced, the target's attacks with them deal 1d4 less damage (this can't reduce the damage below 1). \\par \\hfill (2/2)",
      "page": "PHB 237",
      "range": "30 feet",
      "components": "V, S, M",
      "material": "A pinch of iron powder.",
      "ritual": "no",
      "duration": "Up to 1 minute",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "2nd-level",
      "level_int": 2,
      "school": "Transmutation",
      "class": "Artificer, Sorcerer, Wizard"
    },
    {
      "name": "Find Familiar",
      "desc": "You gain the service of a familiar, a spirit that takes an animal form you choose: bat, cat, crab, frog (toad), hawk, lizard, octopus, owl, poisonous snake, fish (quipper), rat, raven, sea horse, spider, or weasel. Appearing in an unoccupied space within range, the familiar has the statistics of the chosen form, though it is a celestial, fey, or fiend (your choice) instead of a beast. \\par Your familiar acts independently of you, but it always obeys your commands. In combat, it rolls its own initiative and acts on its own turn. A familiar can't attack, but it can take other actions as normal. \\par When the familiar drops to 0 hit points, it disappears, leaving behind no physical form. It reappears after you cast this spell again. \\par While your familiar is within 100 feet of you, you can communicate with it telepathically. Additionally, as an action, you can see through your familiar's eyes and hear what it hears until the start of your next turn, gaining the benefits of any special senses that the familiar has. During this time, you are deaf and blind with regard to your own senses. \\par \\hfill (1/2)",
      "page": "PHB 240",
      "range": "10 feet",
      "components": "V, S, M",
      "material": "10 gp worth of charcoal, incense, and herbs that must be consumed by fire in a brass brazier",
      "ritual": "yes",
      "duration": "Instantaneous",
      "concentration": "no",
      "casting_time": "1 hour",
      "level": "1st-level",
      "level_int": 1,
      "school": "Conjuration",
      "class": "Wizard"
    },
    {
      "name": "Find Familiar",
      "desc": "As an action, you can temporarily dismiss your familiar. It disappears into a pocket dimension where it awaits your summons. Alternatively, you can dismiss it forever. As an action while it is temporarily dismissed, you can cause it to reappear in any unoccupied space within 30 feet of you. \\par You can't have more than one familiar at a time. If you cast this spell while you already have a familiar, you instead cause it to adopt a new form. Choose one of the forms from the above list. Your familiar transforms into the chosen creature. \\par Finally, when you cast a spell with a range of touch, your familiar can deliver the spell as if it had cast the spell. Your familiar must be within 100 feet of you, and it must use its reaction to deliver the spell when you cast it. If the spell requires an attack roll, you use your attack modifier for the roll. \\par \\hfill (2/2)",
      "page": "PHB 240",
      "range": "10 feet",
      "components": "V, S, M",
      "material": "10 gp worth of charcoal, incense, and herbs that must be consumed by fire in a brass brazier",
      "ritual": "yes",
      "duration": "Instantaneous",
      "concentration": "no",
      "casting_time": "1 hour",
      "level": "1st-level",
      "level_int": 1,
      "school": "Conjuration",
      "class": "Wizard"
    },
    {
      "name": "Glyph of Warding",
      "desc": "When you cast this spell, you inscribe a glyph that harms other creatures, either upon a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph. If you choose a surface, the glyph can cover an area of the surface no larger than 10 feet in diameter. If you choose an object, that object must remain in its place; if the object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered. \\par The glyph is nearly invisible and requires a successful Intelligence (Investigation) check against your spell save DC to be found. \\par You decide what triggers the glyph when you cast the spell. For glyphs inscribed on a surface, the most typical triggers include touching or standing on the glyph, removing another object covering the glyph, approaching within a certain distance of the glyph, or manipulating the object on which the glyph is inscribed. For glyphs inscribed within an object, the most common triggers include opening that object, approaching within a certain distance of the object, or seeing or reading the glyph. Once a glyph is triggered, this spell ends. \\par You can further refine the trigger so the spell activates only under certain circumstances or according to physical characteristics (such as height or weight), creature kind (for example, the ward could be set to affect aberrations or drow), or alignment. You can also set conditions for creatures that don't trigger the glyph, such as those who say a certain password. \\par \\hfill (1/2)",
      "page": "PHB 245",
      "range": "Touch",
      "components": "V, S, M",
      "material": "Incense and powdered diamond worth at least 200 gp, which the spell consumes.",
      "ritual": "no",
      "duration": "Until dispelled or triggered",
      "concentration": "no",
      "casting_time": "1 hour",
      "level": "3rd-level",
      "level_int": 3,
      "school": "Abjuration",
      "class": "Artificer, Bard, Cleric, Wizard"
    },
    {
      "name": "Glyph of Warding",
      "desc": "When you inscribe the glyph, choose explosive runes or a spell glyph. \\par\\textbf{Explosive Runes.} When triggered, the glyph erupts with magical energy in a 20-foot radius sphere centered on the glyph. The sphere spreads around corners. Each creature in the area must make a Dexterity saving throw. A creature takes 5d8 acid, cold, fire, lightning, or thunder damage on a failed saving throw (your choice when you create the glyph), or half as much damage on a successful one. \\par\\textbf{Spell Glyph.} You can store a prepared spell of 3rd level or lower in the glyph by casting it as part of creating the glyph. The spell must target a single creature or an area. The spell being stored has no immediate effect when cast in this way. When the glyph is triggered, the stored spell is cast. If the spell has a target, it targets the creature that triggered the glyph. If the spell affects an area, the area is centered on that creature. If the spell summons hostile creatures or creates harmful objects or traps, they appear as close as possible to the intruder and attack it. If the spell requires concentration, it lasts until the end of its full duration.",
      "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the damage of an explosive runes glyph increases by 1d8 for each slot level above 3rd. If you create a spell glyph, you can store any spell of up to the same level as the slot you use for the glyph of warding. \\par \\hfill (2/2)",
      "page": "PHB 245",
      "range": "Touch",
      "components": "V, S, M",
      "material": "Incense and powdered diamond worth at least 200 gp, which the spell consumes.",
      "ritual": "no",
      "duration": "Until dispelled or triggered",
      "concentration": "no",
      "casting_time": "1 hour",
      "level": "3rd-level",
      "level_int": 3,
      "school": "Abjuration",
      "class": "Artificer, Bard, Cleric, Wizard"
    },
    {
      "name": "Guards and Wards",
      "desc": "You create a ward that protects up to 2,500 square feet of floor space (an area 50 feet square, or one hundred 5-foot squares or twenty-five 10-foot squares). The warded area can be up to 20 feet tall, and shaped as you desire. You can ward several stories of a stronghold by dividing the area among them, as long as you can walk into each contiguous area while you are casting the spell. \\par When you cast this spell, you can specify individuals that are unaffected by any or all of the effects that you choose. You can also specify a password that, when spoken aloud, makes the speaker immune to these effects. \\textit{Guards and wards} creates the following effects within the warded area. \\par\\textbf{Corridors.} Fog fills all the warded corridors, making them heavily obscured. In addition, at each intersection or branching passage offering a choice of direction, there is a 50 percent chance that a creature other than you will believe it is going in the opposite direction from the one it chooses. \\par\\textbf{Doors.} All doors in the warded area are magically locked, as if sealed by an arcane lock spell. In addition, you can cover up to ten doors with an illusion (equivalent to the illusory object function of the minor illusion spell) to make them appear as plain sections of wall. \\par \\hfill (1/2)",
      "page": "PHB 248",
      "range": "Touch",
      "components": "V, S, M",
      "material": "Burning incense, a small measure of brimstone and oil, a knotted string, a small amount of umber hulk blood, and a small silver rod worth at least 10 gp.",
      "ritual": "no",
      "duration": "24 hours",
      "concentration": "no",
      "casting_time": "10 minutes",
      "level": "6th-level",
      "level_int": 6,
      "school": "Abjuration",
      "class": "Bard, Wizard"
    },
    {
      "name": "Guards and Wards",
      "desc": "\\textbf{Stairs.} Webs fill all stairs in the warded area from top to bottom, as the web spell. These strands regrow in 10 minutes if they are burned or torn away while guards and wards lasts. \\par\\textbf{Other Spell Effect.} You can place your choice of one of the following magical effects within the warded area of the stronghold. \\begin{itemize}[leftmargin=1.5em,topsep=0pt,noitemsep] \\item Place dancing lights in four corridors. You can designate a simple program that the lights repeat as long as guards and wards lasts. \\item Place magic mouth in two locations. \\item Place stinking cloud in two locations. The vapors appear in the places you designate; they return within 10 minutes if dispersed by wind while guards and wards lasts. \\item Place a constant gust of wind in one corridor or room. \\item Place a suggestion in one location. You select an area of up to 5 feet square, and any creature that enters or passes through the area receives the suggestion mentally. \\end{itemize} The whole warded area radiates magic. A \\textit{dispel magic} cast on a specific effect, if successful, removes only that effect. You can create a permanently guarded and warded structure by casting this spell there every day for one year. \\par \\hfill (2/2)",
      "page": "PHB 248",
      "range": "Touch",
      "components": "V, S, M",
      "material": "Burning incense, a small measure of brimstone and oil, a knotted string, a small amount of umber hulk blood, and a small silver rod worth at least 10 gp.",
      "ritual": "no",
      "duration": "24 hours",
      "concentration": "no",
      "casting_time": "10 minutes",
      "level": "6th-level",
      "level_int": 6,
      "school": "Abjuration",
      "class": "Bard, Wizard"
    },
    {
      "name": "Hallow",
      "desc": "You touch a point and infuse an area around it with holy (or unholy) power. The area can have a radius up to 60 feet, and the spell fails if the radius includes an area already under the effect a hallow spell. The affected area is subject to the following effects. \\par First, celestials, elementals, fey, fiends, and undead can't enter the area, nor can such creatures charm, frighten, or possess creatures within it. Any creature charmed, frightened, or possessed by such a creature is no longer charmed, frightened, or possessed upon entering the area. You can exclude one or more of those types of creatures from this effect. \\par Second, you can bind an extra effect to the area. Choose the effect from the following list, or choose an effect offered by the DM. Some of these effects apply to creatures in the area; you can designate whether the effect applies to all creatures, creatures that follow a specific deity or leader, or creatures of a specific sort, such as ores or trolls. When a creature that would be affected enters the spell's area for the first time on a turn or starts its turn there, it can make a charisma saving throw. On a success, the creature ignores the extra effect until it leaves the area. \\par \\hfill (1/2)",
      "page": "PHB 249",
      "range": "Touch",
      "components": "V, S, M",
      "material": "Herbs, oils, and incense worth at least 1,000 gp, which the spell consumes.",
      "ritual": "no",
      "duration": "Until dispelled",
      "concentration": "no",
      "casting_time": "24 hours",
      "level": "5th-level",
      "level_int": 5,
      "school": "Evocation",
      "class": "Cleric, Warlock",
      "archetype": "Warlock: Fiend",
      "patrons": "Fiend"
    },
    {
      "name": "Hallow",
      "desc": "\\vskip 4pt \\begin{itemize}[leftmargin=1.5em,topsep=0pt,noitemsep] \\item \\textbf{Courage.} Affected creatures can't be frightened while in the area. \\item \\textbf{Darkness.} Darkness fills the area. Normal light, as well as magical light created by spells of a lower level than the slot you used to cast this spell, can't illuminate the area. \\item \\textbf{Daylight.} Bright light fills the area. Magical darkness created by spells of a lower level than the slot you used to cast this spell can't extinguish the light. \\item \\textbf{Energy Protection.} Affected creatures in the area have resistance to one damage type of your choice, except for bludgeoning, piercing, or slashing. \\item \\textbf{Energy Vulnerability.} Affected creatures in the area have vulnerability to one damage type of your choice, except for bludgeoning, piercing, or slashing. \\item \\textbf{Everlasting Rest.} Dead bodies interred in the area can't be turned into undead. \\item \\textbf{Extradimensional Interference.} Affected creatures can't move or travel using teleportation or by extradimensional or interplanar means. \\item \\textbf{Fear.} Affected creatures are frightened while in the area. \\item \\textbf{Silence.} No sound can emanate from within the area, and no sound can reach into it. \\item \\textbf{Tongues.} Affected creatures can communicate with any other creature in the area, even if they don't share a common language. \\end{itemize} \\hfill (2/2)",
      "page": "PHB 249",
      "range": "Touch",
      "components": "V, S, M",
      "material": "Herbs, oils, and incense worth at least 1,000 gp, which the spell consumes.",
      "ritual": "no",
      "duration": "Until dispelled",
      "concentration": "no",
      "casting_time": "24 hours",
      "level": "5th-level",
      "level_int": 5,
      "school": "Evocation",
      "class": "Cleric, Warlock",
      "archetype": "Warlock: Fiend",
      "patrons": "Fiend"
    },
    {
      "name": "Imprisonment",
      "desc": "You create a magical restraint to hold a creature that you can see within range. The target must succeed on a wisdom saving throw or be bound by the spell; if it succeeds, it is immune to this spell if you cast it again. While affected by this spell, the creature doesn't need to breathe, eat, or drink, and it doesn't age. Divination spells can't locate or perceive the target. \\par When you cast the spell, you choose one of the following forms of imprisonment. \\par\\textbf{Burial.} The target is entombed far beneath the earth in a sphere of magical force that is just large enough to contain the target. Nothing can pass through the sphere, nor can any creature teleport or use planar travel to get into or out of it. The special component for this version of the spell is a small mithral orb. \\par\\textbf{Chaining.} Heavy chains, firmly rooted in the ground, hold the target in place. The target is restrained until the spell ends, and it can't move or be moved by any means until then. The special component for this version of the spell is a fine chain of precious metal. \\par\\textbf{Hedged Prison.} The spell transports the target into a tiny demiplane that is warded against teleportation and planar travel. The demiplane can be a labyrinth, a cage, a tower, or any similar confined structure or area of your choice. The special component for this version of the spell is a miniature representation of the prison made from jade. \\par \\hfill (1/2)",
      "page": "PHB 252",
      "range": "30 feet",
      "components": "V, S, M",
      "material": "A vellum depiction or a carved statuette in the likeness of the target, and a special component that varies according to the version of the spell you choose, worth at least 500gp per Hit Die of the target.",
      "ritual": "no",
      "duration": "Until dispelled",
      "concentration": "no",
      "casting_time": "1 minute",
      "level": "9th-level",
      "level_int": 9,
      "school": "Abjuration",
      "class": "Warlock, Wizard"
    },
    {
      "name": "Imprisonment",
      "desc": "\\textbf{Minimus Containment.} The target shrinks to a height of 1 inch and is imprisoned inside a gemstone or similar object. Light can pass through the gemstone normally (allowing the target to see out and other creatures to see in), but nothing else can pass through, even by means of teleportation or planar travel. The gemstone can't be cut or broken while the spell remains in effect. The special component for this version of the spell is a large, transparent gemstone, such as a corundum, diamond, or ruby. \\par\\textbf{Slumber.} The target falls asleep and can't be awoken. The special component for this version of the spell consists of rare soporific herbs. \\par\\textbf{Ending the Spell.} During the casting of the spell, in any of its versions, you can specify a condition that will cause the spell to end and release the target. The condition can be as specific or as elaborate as you choose, but the DM must agree that the condition is reasonable and has a likelihood of coming to pass. The conditions can be based on a creature's name, identity, or deity but otherwise must be based on observable actions or qualities and not based on intangibles such as level, class, or hit points. \\par A \\textit{dispel magic} spell can end the spell only if it is cast as a 9th-level spell, targeting either the prison or the special component used to create it. \\par You can use a particular special component to create only one prison at a time. If you cast the spell again using the same component, the target of the first casting is immediately freed from its binding. \\par \\hfill (2/2)",
      "page": "PHB 252",
      "range": "30 feet",
      "components": "V, S, M",
      "material": "A vellum depiction or a carved statuette in the likeness of the target, and a special component that varies according to the version of the spell you choose, worth at least 500gp per Hit Die of the target.",
      "ritual": "no",
      "duration": "Until dispelled",
      "concentration": "no",
      "casting_time": "1 minute",
      "level": "9th-level",
      "level_int": 9,
      "school": "Abjuration",
      "class": "Warlock, Wizard"
    },
    {
      "name": "Magic Jar",
      "desc": "Your body falls into a catatonic state as your soul leaves it and enters the container you used for the spell's material component. While your soul inhabits the container, you are aware of your surroundings as if you were in the container's space. You can't move or use reactions. The only action you can take is to project your soul up to 100 feet out of the container, either returning to your living body (and ending the spell) or attempting to possess a humanoids body. \\par You can attempt to possess any humanoid within 100 feet of you that you can see (creatures warded by a protection from evil and good or magic circle spell can't be possessed). The target must make a charisma saving throw. On a failure, your soul moves into the target's body, and the target's soul becomes trapped in the container. On a success, the target resists your efforts to possess it, and you can't attempt to possess it again for 24 hours. \\par Once you possess a creature's body, you control it. Your game statistics are replaced by the statistics of the creature, though you retain your alignment and your Intelligence, Wisdom, and Charisma scores. You retain the benefit of your own class features. If the target has any class levels, you can't use any of its class features. \\par \\hfill (1/2)",
      "page": "PHB 257",
      "range": "Self",
      "components": "V, S, M",
      "material": "A gem, crystal, reliquary, or some other ornamental container worth at least 500 gp.",
      "ritual": "no",
      "duration": "Until dispelled",
      "concentration": "no",
      "casting_time": "1 minute",
      "level": "6th-level",
      "level_int": 6,
      "school": "Necromancy",
      "class": "Wizard"
    },
    {
      "name": "Magic Jar",
      "desc": "Meanwhile, the possessed creature's soul can perceive from the container using its own senses, but it can't move or take actions at all. \\par While possessing a body, you can use your action to return from the host body to the container if it is within 100 feet of you, returning the host creature's soul to its body. If the host body dies while you're in it, the creature dies, and you must make a charisma saving throw against your own spellcasting DC. On a success, you return to the container if it is within 100 feet of you. Otherwise, you die. \\par If the container is destroyed or the spell ends, your soul immediately returns to your body. If your body is more than 100 feet away from you or if your body is dead when you attempt to return to it, you die. If another creature's soul is in the container when it is destroyed, the creature's soul returns to its body if the body is alive and within 100 feet. Otherwise, that creature dies. \\par When the spell ends, the container is destroyed. \\par \\hfill (2/2)",
      "page": "PHB 257",
      "range": "Self",
      "components": "V, S, M",
      "material": "A gem, crystal, reliquary, or some other ornamental container worth at least 500 gp.",
      "ritual": "no",
      "duration": "Until dispelled",
      "concentration": "no",
      "casting_time": "1 minute",
      "level": "6th-level",
      "level_int": 6,
      "school": "Necromancy",
      "class": "Wizard"
    },
    {
      "name": "Modify Memory",
      "desc": "You attempt to reshape another creature's memories. One creature that you can see must make a wisdom saving throw. If you are fighting the creature, it has advantage on the saving throw. On a failed save, the target becomes charmed by you for the duration. The charmed target is incapacitated and unaware of its surroundings, though it can still hear you. If it takes any damage or is targeted by another spell, this spell ends, and none of the target's memories are modified. \\par While this charm lasts, you can affect the target's memory of an event that it experienced within the last 24 hours and that lasted no more than 10 minutes. You can permanently eliminate all memory of the event, allow the target to recall the event with perfect clarity and exacting detail, change its memory of the details of the event, or create a memory of some other event. \\par You must speak to the target to describe how its memories are affected, and it must be able to understand your language for the modified memories to take root. Its mind fills in any gaps in the details of your description. If the spell ends before you have finished describing the modified memories, the creature's memory isn't altered. Otherwise, the modified memories take hold when the spell ends. \\par \\hfill (1/2)",
      "page": "PHB 261",
      "range": "30 feet",
      "components": "V, S",
      "ritual": "no",
      "duration": "Up to 1 minute",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "5th-level",
      "level_int": 5,
      "school": "Enchantment",
      "class": "Bard, Cleric, Wizard",
      "archetype": "Cleric: Trickery",
      "domains": "Trickery"
    },
    {
      "name": "Modify Memory",
      "desc": "A modified memory doesn't necessarily affect how a creature behaves, particularly if the memory contradicts the creature's natural inclinations, alignment, or beliefs. An illogical modified memory, such as implanting a memory of how much the creature enjoyed dousing itself in acid, is dismissed, perhaps as a bad dream. The DM might deem a modified memory too nonsensical to affect a creature in a significant manner. \\par A \\textit{remove curse} or \\textit{greater restoration} spell cast on the target restores the creature's true memory. ",
      "higher_level": "If you cast this spell using a spell slot of 6th level or higher, you can alter the target's memories of an event that took place up to 7 days ago (6th level), 30 days ago (7th level), 1 year ago (8th level), or any time in the creature's past (9th level). \\par \\hfill (2/2)",
      "page": "PHB 261",
      "range": "30 feet",
      "components": "V, S",
      "ritual": "no",
      "duration": "Up to 1 minute",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "5th-level",
      "level_int": 5,
      "school": "Enchantment",
      "class": "Bard, Cleric, Wizard",
      "archetype": "Cleric: Trickery",
      "domains": "Trickery"
    },
    {
      "name": "Planar Ally",
      "desc": "You beseech an otherworldly entity for aid. The being must be known to you: a god, a primordial, a demon prince, or some other being of cosmic power. That entity sends a celestial, an elemental, or a fiend loyal to it to aid you, making the creature appear in an unoccupied space within range. If you know a specific creature's name, you can speak that name when you cast this spell to request that creature, though you might get a different creature anyway (DM's choice). \\par When the creature appears, it is under no compulsion to behave in any particular way. You can ask the creature to perform a service in exchange for payment, but it isn't obliged to do so. The requested task could range from simple (fly us across the chasm, or help us fight a battle) to complex (spy on our enemies, or protect us during our foray into the dungeon). You must be able to communicate with the creature to bargain for its services. \\par Payment can take a variety of forms. A celestial might require a sizable donation of gold or magic items to an allied temple, while a fiend might demand a living sacrifice or a gift of treasure. Some creatures might exchange their service for a quest undertaken by you. \\par \\hfill (1/2)",
      "page": "PHB 265",
      "range": "60 feet",
      "components": "V, S",
      "ritual": "no",
      "duration": "Instantaneous",
      "concentration": "no",
      "casting_time": "10 minutes",
      "level": "6th-level",
      "level_int": 6,
      "school": "Conjuration",
      "class": "Cleric"
    },
    {
      "name": "Planar Ally",
      "desc": "As a rule of thumb, a task that can be measured in minutes requires a payment worth 100 gp per minute. A task measured in hours requires 1,000 gp per hour. And a task measured in days (up to 10 days) requires 10,000 gp per day. The DM can adjust these payments based on the circumstances under which you cast the spell. If the task is aligned with the creature's ethos, the payment might be halved or even waived. Nonhazardous tasks typically require only half the suggested payment, while especially dangerous tasks might require a greater gift. Creatures rarely accept tasks that seem suicidal. \\par After the creature completes the task, or when the agreed-upon duration of service expires, the creature returns to its home plane after reporting back to you, if appropriate to the task and if possible. If you are unable to agree on a price for the creature's service, the creature immediately returns to its home plane. \\par A creature enlisted to join your group counts as a member of it, receiving a full share of experience points awarded. \\par \\hfill (2/2)",
      "page": "PHB 265",
      "range": "60 feet",
      "components": "V, S",
      "ritual": "no",
      "duration": "Instantaneous",
      "concentration": "no",
      "casting_time": "10 minutes",
      "level": "6th-level",
      "level_int": 6,
      "school": "Conjuration",
      "class": "Cleric"
    },
    {
      "name": "Prismatic Wall",
      "desc": "A shimmering, multicolored plane of light forms a vertical opaque wall-up to 90 feet long, 30 feet high, and 1 inch thick-centered on a point you can see within range. Alternatively, you can shape the wall into a sphere up to 30 feet in diameter centered on a point you choose within range. The wall remains in place for the duration. If you position the wall so that it passes through a space occupied by a creature, the spell fails, and your action and the spell slot are wasted. \\par The wall sheds bright light out to a range of 100 feet and dim light for an additional 100 feet. You and creatures you designate at the time you cast the spell can pass through and remain near the wall without harm. If another creature that can see the wall moves to within 20 feet of it or starts its turn there, the creature must succeed on a constitution saving throw or become blinded for 1 minute. \\par The wall consists of seven layers, each with a different color. When a creature attempts to reach into or pass through the wall, it does so one layer at a time through all the wall's layers. As it passes or reaches through each layer, the creature must make a dexterity saving throw or be affected by that layer's properties as described below. \\par The wall can be destroyed, also one layer at a time, in order from red to violet, by means specific to each layer. Once a layer is destroyed, it remains so for the duration of the spell. A rod of cancellation destroys a prismatic wall, but an \\textit{antimagic field} has no effect on it. \\par \\hfill (1/2)",
      "page": "PHB 267",
      "range": "60 feet",
      "components": "V, S",
      "ritual": "no",
      "duration": "10 minutes",
      "concentration": "no",
      "casting_time": "1 action",
      "level": "9th-level",
      "level_int": 9,
      "school": "Abjuration",
      "class": "Wizard"
    },
    {
      "name": "Prismatic Wall",
      "desc": "\\textbf{Red.} The creature takes 10d6 fire damage on a failed save, or half as much damage on a successful one. While this layer is in place, nonmagical ranged attacks can't pass through the wall. The layer can be destroyed by dealing at least 25 cold damage to it. \\par \\textbf{Orange.} The creature takes 10d6 acid damage on a failed save, or half as much damage on a successful one. While this layer is in place, magical ranged attacks can't pass through the wall. The layer is destroyed by a strong wind. \\par \\textbf{Yellow.} The creature takes 10d6 lightning damage on a failed save, or half as much damage on a successful one. This layer can be destroyed by dealing at least 60 force damage to it. \\par \\textbf{Green.} The creature takes 10d6 poison damage on a failed save, or half as much damage on a successful one. A \\textit{passwall} spell, or another spell of equal or greater level that can open a portal on a solid surface, destroys this layer. \\par \\textbf{Blue.} The creature takes 10d6 cold damage on a failed save, or half as much damage on a successful one. This layer can be destroyed by dealing at least 25 fire damage to it. \\par \\textbf{Indigo.} On a failed save, the creature is restrained. It must then make a constitution saving throw at the end of each of its turns. If it successfully saves three times, the spell ends. If it fails its save three times, it permanently turns to stone and is subjected to the petrified condition. The successes and failures don't need to be consecutive; keep track of both until the creature collects three of a kind. While this layer is in place, spells can't be cast through the wall. The layer is destroyed by bright light shed by a \\textit{daylight} spell or a similar spell of equal or higher level. \\par \\textbf{Violet.} On a failed save, the creature is blinded. It must then make a wisdom saving throw at the start of your next turn. A successful save ends the blindness. If it fails that save, the creature is transported to another plane of the DM's choosing and is no longer blinded. (Typically, a creature that is on a plane that isn't its home plane is banished home, while other creatures are usually cast into the Astral or Ethereal planes.) This layer is destroyed by a \\textit{dispel magic} spell or a similar spell of equal or higher level that can end spells and magical effects. \\par \\hfill (2/2)",
      "page": "PHB 267",
      "range": "60 feet",
      "components": "V, S",
      "ritual": "no",
      "duration": "10 minutes",
      "concentration": "no",
      "casting_time": "1 action",
      "level": "9th-level",
      "level_int": 9,
      "school": "Abjuration",
      "class": "Wizard"
    },
    {
      "name": "Symbol",
      "desc": "When you cast this spell, you inscribe a harmful glyph either on a surface or within an object that can be closed to conceal the glyph (such as a book, a scroll, or a treasure chest). If you choose a surface, the glyph can cover an area of the surface no larger than 10 feet in diameter. If you choose an object, that object must remain in its place; if the object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered. The glyph is nearly invisible, requiring an Intelligence (Investigation) check against your spell save DC to find it. \\par You decide what triggers the glyph when you cast the spell. For glyphs inscribed on a surface, the most typical triggers include touching or stepping on the glyph, removing another object covering it, approaching within a certain distance of it, or manipulating the object that holds it. For glyphs inscribed within an object, the most common triggers are opening the object, approaching within a certain distance of it, or seeing or reading the glyph. \\par You can further refine the trigger so the spell is activated only under certain circumstances or according to a creature's physical characteristics (such as height or weight), or physical kind (for example, the ward could be set to affect hags or shapechangers). You can also specify creatures that don't trigger the glyph, such as those who say a certain password. \\par \\hfill (1/2)",
      "page": "PHB 280",
      "range": "Touch",
      "components": "V, S, M",
      "material": "Mercury, phosphorus, and powdered diamond and opal with a total value of at least 1,000 gp, which the spell consumes.",
      "ritual": "no",
      "duration": "Until dispelled or triggered",
      "concentration": "no",
      "casting_time": "1 minute",
      "level": "7th-level",
      "level_int": 7,
      "school": "Abjuration",
      "class": "Bard, Cleric, Wizard"
    },
    {
      "name": "Symbol",
      "desc": "When you inscribe the glyph, choose one of the options below for its effect. Once triggered, the glyph glows, filling a 60-foot-radius sphere with dim light for 10 minutes, after which time the spell ends. Each creature in the sphere when the glyph activates is targeted by its effect, as is a creature that enters the sphere for the first time on a turn or ends its turn there. \\begin{itemize}[leftmargin=1.5em,topsep=0pt,noitemsep] \\item \\textbf{Death.} Each target must make a constitution saving throw, taking 10d 10 necrotic damage on a failed save, or half as much damage on a successful save. \\item \\textbf{Discord.} Each target must make a constitution saving throw. On a failed save, a target bickers and argues with other creatures for 1 minute. During this time, it is incapable of meaningful communication and has disadvantage on attack rolls and ability checks. \\item \\textbf{Fear.} Each target must make a wisdom saving throw and becomes frightened for 1 minute on a failed save. While frightened, the target drops whatever it is holding and must move at least 30 feet away from the glyph on each of its turns, if able. \\item \\textbf{Hopelessness.} Each target must make a charisma saving throw. On a failed save, the target is overwhelmed with despair for 1 minute. During this time, it can't attack or target any creature with harmful abilities, spells, or other magical effects. \\item \\textbf{Insanity.} Each target must make an intelligence saving throw. On a failed save, the target is driven insane for 1 minute. An insane creature can't take actions, can't understand what other creatures say, can't read, and speaks only in gibberish. The DM controls its movement, which is erratic. \\item \\textbf{Pain.} Each target must make a constitution saving throw and becomes incapacitated with excruciating pain for 1 minute on a failed save. \\item \\textbf{Sleep.} Each target must make a wisdom saving throw and falls unconscious for 10 minutes on a failed save. A creature awakens if it takes damage or if someone uses an action to shake or slap it awake. \\item \\textbf{Stunning.} Each target must make a wisdom saving throw and becomes stunned for 1 minute on a failed save. \\end{itemize} \\hfill (2/2)",
      "page": "PHB 280",
      "range": "Touch",
      "components": "V, S, M",
      "material": "Mercury, phosphorus, and powdered diamond and opal with a total value of at least 1,000 gp, which the spell consumes.",
      "ritual": "no",
      "duration": "Until dispelled or triggered",
      "concentration": "no",
      "casting_time": "1 minute",
      "level": "7th-level",
      "level_int": 7,
      "school": "Abjuration",
      "class": "Bard, Cleric, Wizard"
    },
    {
      "name": "Telekinesis",
      "desc": "You gain the ability to move or manipulate creatures or objects by thought. When you cast the spell, and as your action each round for the duration, you can exert your will on one creature or object that you can see within range, causing the appropriate effect below. You can affect the same target round after round, or choose a new one at any time. If you switch targets, the prior target is no longer affected by the spell. \\par\\textbf{Creature.} You can try to move a Huge or smaller creature. Make an ability check with your spellcasting ability contested by the creature's Strength check. If you win the contest, you move the creature up to 30 feet in any direction, including upward but not beyond the range of this spell. Until the end of your next turn, the creature is restrained in your telekinetic grip. A creature lifted upward is suspended in mid-air. On subsequent rounds, you can use your action to attempt to maintain your telekinetic grip on the creature by repeating the contest. \\par \\hfill (1/2)",
      "page": "PHB 280",
      "range": "60 feet",
      "components": "V, S",
      "ritual": "no",
      "duration": "Up to 10 minutes",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "5th-level",
      "level_int": 5,
      "school": "Transmutation",
      "class": "Sorcerer, Warlock, Wizard",
      "archetype": "Warlock: Great Old One",
      "patrons": "Great Old One"
    },
    {
      "name": "Telekinesis",
      "desc": "\\textbf{Object.} You can try to move an object that weighs up to 1,000 pounds. If the object isn't being worn or carried, you automatically move it up to 30 feet in any direction, but not beyond the range of this spell. \\par If the object is worn or carried by a creature, you must make an ability check with your spellcasting ability contested by that creature's Strength check. If you succeed, you pull the object away from that creature and can move it up to 30 feet in any direction but not beyond the range of this spell. \\par You can exert fine control on objects with your telekinetic grip, such as manipulating a simple tool, opening a door or a container, stowing or retrieving an item from an open container, or pouring the contents from a vial. \\par \\hfill (2/2)",
      "page": "PHB 280",
      "range": "60 feet",
      "components": "V, S",
      "ritual": "no",
      "duration": "Up to 10 minutes",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "5th-level",
      "level_int": 5,
      "school": "Transmutation",
      "class": "Sorcerer, Warlock, Wizard",
      "archetype": "Warlock: Great Old One",
      "patrons": "Great Old One"
    },
    {
      "name": "True Polymorph",
      "desc": "Choose one creature or nonmagical object that you can see within range. You transform the creature into a different creature, the creature into an object, or the object into a creature (the object must be neither worn nor carried by another creature).  The transformation lasts for the duration, or until the target drops to 0 hit points or dies. If you concentrate on this spell for the full duration, the transformation lasts until it is dispelled. \\par This spell has no effect on a shapechanger or a creature with 0 hit points. An unwilling creature can make a Wisdom saving throw, and if it succeeds, it isn't affected by this spell. \\par\\textbf{Creature into Creature.} If you turn a creature into another kind of creature, the new form can be any kind you choose whose challenge rating is equal to or less than the target's (or its level, if the target doesn't have a challenge rating). The target's game statistics, including mental ability scores, are replaced by the statistics of the new form. It retains its alignment and personality. \\par The target assumes the hit points of its new form, and when it reverts to its normal form, the creature returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 hit points, any excess damage carries over to its normal form. As long as the excess damage doesn't reduce the creature's normal form to 0 hit points, it isn't knocked unconscious. \\par \\hfill (1/2)",
      "page": "PHB 283",
      "range": "30 feet",
      "components": "V, S, M",
      "material": "A drop of mercury, a dollop of gum arabic, and a wisp of smoke.",
      "ritual": "no",
      "duration": "Up to 1 hour",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "9th-level",
      "level_int": 9,
      "school": "Transmutation",
      "class": "Bard, Warlock, Wizard"
    },
    {
      "name": "True Polymorph",
      "desc": "The creature is limited in the actions it can perform by the nature of its new form, and it can't speak, cast spells, or take any other action that requires hands or speech unless its new form is capable of such actions. The target's gear melds into the new form. The creature can't activate, use, wield, or otherwise benefit from any of its equipment. \\par \\textbf{Object into Creature.} You can turn an object into any kind of creature, as long as the creature's size is no larger than the object's size and the creature's challenge rating is 9 or lower. The creature is friendly to you and your companions. It acts on each of your turns. You decide what action it takes and how it moves. The DM has the creature's statistics and resolves all of its actions and movement. If the spell becomes permanent, you no longer control the creature. It might remain friendly to you, depending on how you have treated it. \\par \\textbf{Creature into Object.} If you turn a creature into an object, it transforms along with whatever it is wearing and carrying into that form. The creature's statistics become those of the object, and the creature has no memory of time spent in this form, after the spell ends and it returns to its normal form. \\par \\hfill (2/2)",
      "page": "PHB 283",
      "range": "30 feet",
      "components": "V, S, M",
      "material": "A drop of mercury, a dollop of gum arabic, and a wisp of smoke.",
      "ritual": "no",
      "duration": "Up to 1 hour",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "9th-level",
      "level_int": 9,
      "school": "Transmutation",
      "class": "Bard, Warlock, Wizard"
    },
    {
      "name": "Wall of Stone",
      "desc": "A nonmagical wall of solid stone springs into existence at a point you choose within range. The wall is 6 inches thick and is composed of ten 10-foot-by-10-foot panels. Each panel must be contiguous with at least one other panel. Alternatively, you can create 10-foot-by-20-foot panels that are only 3 inches thick. \\par If the wall cuts through a creature's space when it appears, the creature is pushed to one side of the wall (your choice). If a creature would be surrounded on all sides by the wall (or the wall and another solid surface), that creature can make a dexterity saving throw. On a success, it can use its reaction to move up to its speed so that it is no longer enclosed by the wall. \\par The wall can have any shape you desire, though it can't occupy the same space as a creature or object. The wall doesn't need to be vertical or rest on any firm foundation. It must, however, merge with and be solidly supported by existing stone. Thus, you can use this spell to bridge a chasm or create a ramp. \\par \\hfill (1/2)",
      "page": "PHB 287",
      "range": "120 feet",
      "components": "V, S, M",
      "material": "A small block of granite.",
      "ritual": "no",
      "duration": "Up to 10 minutes",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "5th-level",
      "level_int": 5,
      "school": "Evocation",
      "class": "Artificer, Druid, Sorcerer, Wizard",
      "circles": "Desert, Mountain"
    },
    {
      "name": "Wall of Stone",
      "desc": "If you create a span greater than 20 feet in length, you must halve the size of each panel to create supports. You can crudely shape the wall to create crenellations, battlements, and so on. \\par The wall is an object made of stone that can be damaged and thus breached. Each panel has AC 15 and 30 hit points per inch of thickness. Reducing a panel to 0 hit points destroys it and might cause connected panels to collapse at the DM's discretion. \\par If you maintain your concentration on this spell for its whole duration, the wall becomes permanent and can't be dispelled. Otherwise, the wall disappears when the spell ends. \\par \\hfill (2/2)",
      "page": "PHB 287",
      "range": "120 feet",
      "components": "V, S, M",
      "material": "A small block of granite.",
      "ritual": "no",
      "duration": "Up to 10 minutes",
      "concentration": "yes",
      "casting_time": "1 action",
      "level": "5th-level",
      "level_int": 5,
      "school": "Evocation",
      "class": "Artificer, Druid, Sorcerer, Wizard",
      "circles": "Desert, Mountain"
    },
    {
      "name": "Wish",
      "desc": "\\textit{Wish} is the mightiest spell a mortal creature can cast. By simply speaking aloud, you can alter the very foundations of reality in accord with your desires. \\par The basic use of this spell is to duplicate any other spell of 8th level or lower. You don't need to meet any requirements in that spell, including costly components. The spell simply takes effect. \\par Alternatively, you can create one of the following effects of your choice: \\begin{itemize}[leftmargin=1.5em,topsep=0pt,noitemsep] \\item You create one object of up to 25,000 gp in value that isn't a magic item. The object can be no more than 300 feet in any dimension, and it appears in an unoccupied space you can see on the ground. \\item YYou allow up to twenty creatures that you can see to regain all hit points, and you end all effects on them described in the greater restoration spell. \\item You grant up to ten creatures you can see resistance to a damage type you choose. \\item You grant up to ten creatures you can see immunity to a single spell or other magical effect for 8 hours. For instance, you could make yourself and all your companions immune to a lich's life drain attack. \\item You undo a single recent event by forcing a reroll of any roll made within the last round (including your last turn). Reality reshapes itself to accommodate the new result. For example, a \\textit{wish} spell could undo an opponent's successful save, a foe's critical hit, or a friend's failed save. You can force the reroll to be made with advantage or disadvantage, and you can choose whether to use the reroll or the original roll. \\end{itemize} \\par \\hfill (1/2)",
      "page": "PHB 288",
      "range": "Self",
      "components": "V",
      "ritual": "no",
      "duration": "Instantaneous",
      "concentration": "no",
      "casting_time": "1 action",
      "level": "9th-level",
      "level_int": 9,
      "school": "Conjuration",
      "class": "Sorcerer, Wizard"
    },
    {
      "name": "Wish",
      "desc": "You might be able to achieve something beyond the scope of the above examples. State your wish to the DM as precisely as possible. The DM has great latitude in ruling what occurs in such an instance; the greater the wish, the greater the likelihood that something goes wrong. This spell might simply fail, the effect you desire might only be partly achieved, or you might suffer some unforeseen consequence as a result of how you worded the wish. For example, wishing that a villain were dead might propel you forward in time to a period when that villain is no longer alive, effectively removing you from the game. Similarly, wishing for a legendary magic item or artifact might instantly transport you to the presence of the item's current owner. \\par The stress of casting this spell to produce any effect other than duplicating another spell weakens you. After enduring that stress, each time you cast a spell until you finish a long rest, you take 1d10 necrotic damage per level of that spell. This damage can't be reduced or prevented in any way. In addition, your Strength drops to 3, if it isn't 3 or lower already, for 2d4 days. For each of those days that you spend resting and doing nothing more than light activity, your remaining recovery time decreases by 2 days. Finally, there is a 33 percent chance that you are unable to cast \\textit{wish} ever again if you suffer this stress. \\par \\hfill (2/2)",
      "page": "PHB 288",
      "range": "Self",
      "components": "V",
      "ritual": "no",
      "duration": "Instantaneous",
      "concentration": "no",
      "casting_time": "1 action",
      "level": "9th-level",
      "level_int": 9,
      "school": "Conjuration",
      "class": "Sorcerer, Wizard"
    }
  ]
}